<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SysTools Mac PST Converter and imports it into Munki.

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.munki.SysToolsMacPSTConverter</string>
	<key>Input</key>
	<dict>
		<key>DERIVE_MIN_OS</key>
		<string>YES</string>
		<key>NAME</key>
		<string>SysTools Mac PST Converter</string>
		<key>MUNKIIMPORT_PKG_NAME</key>
		<string>SysTools Mac PST Converter/SysTools Mac PST Converter.pkg</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/SysTools Mac PST Converter</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>MVP Verified Software to Convert Microsoft Outlook PST File in 14+ File Format on Mac</string>
			<key>developer</key>
			<string>SysTools Software Private Limited</string>
			<key>display_name</key>
			<string>SysTools Mac PST Converter</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.SysToolsMacPSTConverter</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/SysTools Mac PST Converter.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/SysTools Mac PST Converter.app</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/config.properties</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/ErrorWarning.txt</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/EULA.pdf</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/JDK Check Script.sh</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/libchilkat.jnilib</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/License.txt</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/pdfconfig.properties</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/Release Notes.pdf</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/Setting.xml</string>
					<string>/Library/Application Support/SysTools Mac PST Converter/uninstall.app</string>
				</array>
				<key>derive_minimum_os_version</key>
				<string>%DERIVE_MIN_OS%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/SysTools Mac PST Converter.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_pkgname</key>
				<string>%MUNKIIMPORT_PKG_NAME%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
