<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SysTools Mac PST Converter.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.SysToolsMacPSTConverter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SysTools Mac PST Converter</string>
		<key>DOWNLOAD_URL</key>
		<string>https://downloads.systoolsgroup.com/mac-pst-converter.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: SysTools Software Private Limited (E892Z6G43Y)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/SysTools Mac PST Converter.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
