<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest SysTools Mac PST Converter disk image.</string>
        <key>Identifier</key>
        <string>com.github.jelockwood.recipes.download.SysToolsMacPSTConverter</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SysTools Mac PST Converter</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
 		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
           <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
			<key>input_path</key>
			<string>%pathname%/SysTools Mac PST Converter*.pkg</string>
			<key>expected_authority_names</key>
			<array>
				<string>Developer ID Installer: SysTools Software Private Limited (E892Z6G43Y)</string>
				<string>Developer ID Certification Authority</string>
				<string>Apple Root CA</string>
			</array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
