<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of AdoptOpenJDK 13 OpenJ9. Recipe created by Charles Mission.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.munki.AdoptOpenJDK13_OpenJ9_Signed</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/AdoptOpenJDK/13/</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Developer Tools</string>
			<key>description</key>
			<string>AdoptOpenJDK 13 OpenJ9</string>
			<key>developer</key>
			<string>AdoptOpenJDK</string>
			<key>display_name</key>
			<string>AdoptOpenJDK 13</string>
			<key>name</key>
			<string>AdoptOpenJDK 13 OpenJ9</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstall_method</key>
			<string>removepackages</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.AdoptOpenJDK13_OpenJ9_Signed</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
