<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DiffMerge.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.DiffMerge</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DiffMerge</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Safari/537.36</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--request</string>
					<string>POST</string>
					<string>--data</string>
					<string>download=Download%20Now&amp;DMdownloadVersion=mac_pkg</string>
				</array>
				<key>re_pattern</key>
				<string>href="(http:\/\/download\.sourcegear\.com\/DiffMerge\/[\d\.]+/DiffMerge\.[\d\.]+\.intel\.stable\.pkg)"</string>
				<key>url</key>
				<string>http://www.sourcegear.com/diffmerge/downloaded.php</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array/>
				<key>url</key>
				<string>%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
