<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created manually based of an existing recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of libmacgpg-free the version which removes the paywall.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.libmacgpg-free</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>macgpg/libmacgpg-free</string>
		<key>NAME</key>
		<string>libmacgpg-free</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<dict>
				<key>filename</key>
				<string>org.gpgtools.Libmacgpg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
