<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created manually based of an existing recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of libmacgpg-free and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.munki.libmacgpg-free</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>libmacgpgfree</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Libmacgpg-free is a drop-in-replacement for GPG Suite Libmacgpg removing the paywall.</string>
			<key>developer</key>
			<string>macgpg</string>
			<key>display_name</key>
			<string>Libmacgpg-free</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.libmacgpg-free</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
