<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Libmacgpg-free and packages it for installation.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.pkg.libmacgpg-free</string>
	<key>Input</key>
	<dict>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<true/>
		<key>NAME</key>
		<string>libmacgpg-free</string>
		<key>VENDOR</key>
		<string>macgpg</string>
		<key>SOFTWARETITLE</key>
		<string>libmacgpg-free installer</string>
		<key>NAMEWITHOUTSPACES</key>
		<string>libmacgpginstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.libmacgpg-free</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>macgpg/libmacgpg-free</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/Downloads/org.gpgtools.Libmacgpg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/org.gpgtools.Libmacgpg</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_content</key>
				<string>#!/bin/bash

# Determine working directory
install_dir=`dirname $0`

# Install Libmacgpg-free unattended-ly using the pkg from the resources directory
if[ -d "/Library/Application Support/GPGTools/org.gpgtools.Libmacgpg.xpc/Contents/MacOS" ]
then
	/bin/cp "$install_dir/org.gpgtools.Libmacgpg" "/Library/Application Support/GPGTools/org.gpgtools.Libmacgpg/xpc/Contents/MacOS/"
	/bin/chmod 755 "/Library/Application Support/GPGTools/org.gpgtools.Libmacgog.xpc/Contents/MacOS/org.gpgtools.Libmacgpg"
	/bin/launchctl stop org.gpgtools.Libmacgpg.xpc
	/usr/bin/killall org.gpgtools.Libmacgpg.xpc
	/bin/launchctl start org.gpgtools.Libmacgpg.xpc
fi
				</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array/>
					<key>id</key>
					<string>com.jelockwood.libmacgpg-free.pkg</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
