<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Libmacgpg-free and packages it for installation.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.pkg.libmacgpg-free</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>libmacgpg-free</string>
		<key>VENDOR</key>
		<string>macgpg</string>
		<key>SOFTWARETITLE</key>
		<string>libmacgpg-free Installer</string>
		<key>NAMEWITHOUTSPACES</key>
		<string>libmacgpg-free-installer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.libmacgpg-free</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>macgpg/libmacgpg-free</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/org.gpgtools.Libmacgpg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/org.gpgtools.Libmacgpg</string>
				<key>overwrite</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/bash

# Determine working directory
install_dir=$(dirname $0)

# Install the Creative Cloud  application using the Install binary's silent install mode
"${install_dir}/Install.app/Contents/MacOS/Install" --mode=silent</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgname</key>
					<string>%VENDOR%%NAMEWITHOUTSPACES%-%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>com.jelockwood.libmacgpg-free.pkg</string>
					<key>version</key>
					<string>%version%</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
