<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest OmniPresence disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.jelockwood.autopkg.munki.omnipresence</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OmniPresence</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>APPCAST_URL</key>
        <string>http://update.omnigroup.com/appcast/com.omnigroup.OmniPresence</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>OmniPresence is the best way to sync all of your documents across all of your devices. And it works on most web hosts, including OS X Server, which means you can store all of your data yourself. Or pair it up with our own Omni Sync Server for free, secure syncing.</string>
            <key>display_name</key>
            <string>OmniPresence</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%APPCAST_URL%</string>
                <key>alternate_xmlns_url</key>
                <string>http://www.omnigroup.com/namespace/omniappcast/v1</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>