<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of S.M.A.R.T. Monitoring Tools.</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.munki.S.M.A.R.T.MonitoringTools</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>NAME</key>
		<string>smartmontools</string>
		<key>SOURCEFORGE_FILE_PATTERN</key>
		<string>*[0-9\.]*\.dmg</string>
		<key>SOURCEFORGE_PROJECT_ID</key>
		<string>64297</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Disk Inspection and Monitoring</string>
			<key>developer</key>
			<string>smartmontools</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>display_name</key>
			<string>S.M.A.R.T. Monitoring Tools</string>
			<key>unattended_install</key>
			<true/>
			<key>minimum_os_version</key>
			<string>10.7.0</string>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
