<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created manually based off an existing recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of SubEthaEdit and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.munki.subethaedit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SubEthaEdit</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>SubEthaEdit</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Libmacgpg-free is a drop-in-replacement for GPG Suite Libmacgpg removing the paywall.</string>
			<key>category</key>
			<string>Developer Tools</string>
			<key>developer</key>
			<string>TheCodingMonkeys</string>
			<key>display_name</key>
			<string>SubEthaEdit</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.subethaedit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
