<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of JetBrains Toolbox.</string>
    <key>Comment</key>
    <string>For the ARCH_TYPE variable use "mac" for Intel, use "macM1" for Apple Silicon</string>
    <key>Identifier</key>
    <string>com.github.jelockwood.recipes.download.jetbrainstoolbox-arm</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JetBrains Toolbox</string>
        <key>ARCH_TYPE</key>
        <string>macM1</string>
        <key>PROD_CODE</key>
        <string>TBA</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.bnpl.autopkg.download.jetbrains</string>
</dict>
</plist>
