<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Citrix Workspace and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.jelockwood.recipe.munki.CitrixWorkspace</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Citrix Workspace</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>ServiceRecords.app</string>
				<string>DockApplication.app</string>
				<string>AuthManager_Mac.app</string>
				<string>SafariAdapter.app</string>
				<string>Citrix Workspace Updater.app</string>
				<string>Citrix Enterprise Browser Helper (Alerts).app</string>
				<string>(Work) Citrix Enterprise Browser.app</string>
				<string>Citrix Viewer.app</string>
				<string>ctxapphusk.app</string>
				<string>Citrix Enterprise Browser.app</string>
				<string>Citrix Enterprise Browser Helper (Renderer).app</string>
				<string>sessionmanager.app</string>
				<string>Citrix Enterprise Browser Helper.app</string>
				<string>Citrix Enterprise Browser Helper (GPU).app</string>
				<string>Uninstall Citrix Workspace.app</string>
				<string>Citrix Workspace Helper.app</string>
				<string>Citrix Workspace Launcher.app</string>
				<string>HDXCastHelper.app</string>
				<string>NativeMessagingHostApp.app</string>
				<string>Citrix Casting.app</string>
				<string>Citrix Workspace.app</string>
				<string>Citrix Enterprise Browser Helper (Plugin).app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>The new Citrix Workspace app gives users a great experience—a secure, contextual, unified workspace—on any device. Give teams instant access to all their SaaS and web apps, files, mobile apps, Citrix Virtual Apps and Desktops from an easy-to-use, all-in-one interface powered by Citrix Workspace services.</string>
			<key>developer</key>
			<string>Citrix Systems, Inc.</string>
			<key>display_name</key>
			<string>Citrix Workspace</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.jelockwood.recipe.download.CitrixWorkspace</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
