<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Python2 for MunkiReport and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.jelockwood.recipe.munki.MunkiReport-Python2</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>MunkiReport-Python2</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Python.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Developer Tools</string>
			<key>description</key>
			<string>Maintenance release to fix the issue of Apple removing python from macOS 12.3.

IMPORTANT CHANGES
You will need to install MunkiReport-Python2 first on the client or MunkiReport will not run. There's a pre-built Python package available thanks to Per Olofsson: https://github.com/munkireport/MunkiReport-Python/releases/latest

All core modules have been patched to use the new python install, custom or third party modules may need an update if they use python client scripts.</string>
			<key>developer</key>
			<string>MunkiReport</string>
			<key>display_name</key>
			<string>MunkiReport-Python2</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.jelockwood.recipe.download.MunkiReport-Python2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
