<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest Macadmins Python release and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.jelockwood.recipe.munki.Managed-Python3</string>
		<key>ParentRecipe</key>
		<string>com.github.jazzace.download.MacadminsPython</string>
		<key>MinimumVersion</key>
		<string>2.3.0</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Managed-Python3</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/MacadminsPython</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Utilities</string>
				<key>description</key>
				<string>MacadminsPython is a relocatable distribution of Python for Mac Admins</string>
				<key>developer</key>
				<string>Erik Gomez</string>
				<key>display_name</key>
				<string>Managed-Python3</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>minimum_os_version</key>
					<real>11.0</real>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleVersion</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
