<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of FileZilla.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.FileZilla-Intel</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileZilla</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
		<key>SEARCH_URL</key>
		<string>https://filezilla-project.org/download.php?show_all=1</string>
		<key>VERSION_URL</key>
		<string>https://filezilla-project.org/download.php?show_all=1</string>
		<key>CHANNEL</key>
		<string>release</string>
		<key>ARCHITECTURE</key>
		<string>x86</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		    <dict>
				<key>Processor</key>
				<string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
   		    	<key>Arguments</key>
   		    	<dict>
  		       		<key>warning_message</key>
	        	 	<string>This recipe is deprecated and will be removed in the future. This is due to the fact FileZilla have 'hidden' the download URLs inside Javascript and hence it cannot be automatically processed.</string>
	        	</dict>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
		                <string>%VERSION_URL%</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
		                <key>re_pattern</key>
		                <string>(https://dl\d\.cdn\.filezilla-project\.org/client/FileZilla_[\d.]+_macos-%ARCHITECTURE%\.[^"]+)</string>
		                <key>result_output_var_name</key>
		                <string>dlurl</string>
	        </dict>
			<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.tgz</string>
				<key>url</key>
				<string>%dlurl%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app</string>
				<key>requirement</key>
				<string>identifier "org.filezilla-project.filezilla" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5VPGKXL75N"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/FileZilla.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
