<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Takes the latest version of IBM Notifier and creates a package to install in a custom location for use with S.U.P.E.R.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.pkg.IBMNotifier-SUPER</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>IBM Notifier (SUPER)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.precursorca.download.IBMNotifier</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/IBM Notifier.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
