<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Takes the latest version of IBM Notifier and creates a package to install in a custom location for use with S.U.P.E.R.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.pkg.IBMNotifier-SUPER</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>IBM Notifier (SUPER)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.precursorca.download.IBMNotifier</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/IBM Notifier.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
			</dict>
		</dict>
	        <dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/*.app</string>
			</dict>
                </dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/sh
## preinstall

pathToScript=$0
pathToPackage=$1
targetLocation=$2
targetVolume=$3

if [[ -e "/Library/Management/super/IBM Notifier.app" ]]; then
	/usr/bin/sudo /bin/rm -R "/Library/Management/super/IBM Notifier.app/"
fi

exit 0		## Success
exit 1		## Failure
				</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/sh
# Install IBM Notifier app in custom location for use with SUPER
LOGGER="/usr/bin/logger"

# Determine working directory
install_dir=`dirname $0`
	
	
if [[ -e "$install_dir/PCClient.app" ]]; then
		${LOGGER} "Installing PaperCut Client"
		if [[ -e "/Library/Management/super/IBM Notifier.app" ]]; then
			${LOGGER} "Existing copy found of IBM Notifier.app in custom location, proceeding to install update."
			/bin/cp -p -R "$install_dir/IBM Notifier.app" "/Library/Management/super/"
		else
			${LOGGER} "No existing copy of IBM Notifier.app in custom location"
			exit 1
		fi
else
		${LOGGER} "Could not find source file"
fi

exit
				</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgname</key>
					<string>%NAME%_%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>com.jelockwood.ibmnotifier-super</string>
					<key>version</key>
					<string>%version%</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
