<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest release dmg version of Azul Zulu Java for
given Java version, architecture, and bundle type (JDK/JRE),
then uploads the package to munki.
Architectures: x86, arm
Bundle Types: jre, jdk, jre_fx, jdk_fx
Munki Architectures: x86_64, arm64
</string>
		<key>Identifier</key>
		<string>com.jelockwood.recipe.munki.AzulZuluJavaJRE8-arm</string>
		<key>MinimumVersion</key>
		<string>2.3.0</string>
		<key>ParentRecipe</key>
		<string>com.github.davidbpirie.pkg.AzulZuluJava</string>
		<key>Input</key>
		<dict>
			<key>JAVA_MAJOR_VERSION</key>
			<string>8</string>
			<key>NAME</key>
			<string>AzulZuluJavaJRE%JAVA_MAJOR_VERSION%</string>
			<key>ARCHITECTURE</key>
			<string>arm</string>
			<key>BUNDLE_TYPE</key>
			<string>jre</string>
			<key>MUNKI_ARCHITECTURE</key>
			<string>arm64</string>
			<key>MUNKI_CATEGORY</key>
			<string>Developer Tools</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Azul Zulu builds of OpenJDK are open source, TCK-tested and certified builds of OpenJDK. Azul Zulu is available for a wide range of hardware platforms and operating systems.</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Azul Systems</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Azul Zulu Java %JAVA_MAJOR_VERSION% %BUNDLE_TYPE% %ARCHITECTURE%</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.14.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%/%ARCHITECTURE%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>installs</key>
				<array>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>8.0.7</string>
						<key>path</key>
						<string>/Library/Java/JavaVirtualMachines/zulu-8.jre</string>
						<key>type</key>
						<string>bundle</string>
						<key>version_comparison_key</key>
						<string>CFBundleShortVersionString</string>
					</dict>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>supported_architectures</key>
				<array>
					<string>%MUNKI_ARCHITECTURE%</string>
				</array>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
					<key>supported_architectures</key>
					<array>
						<string>%munki_arch%</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pkg_path%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>.*install-location="([^"]*)"</string>
					<key>url</key>
					<string>file://%RECIPE_CACHE_DIR%/unpack/zulu-%JAVA_MAJOR_VERSION%.pkg/PackageInfo</string>
					<key>result_output_var_name</key>
					<string>install_location</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Library</key>
						<string>755</string>
						<key>Library/Java</key>
						<string>755</string>
						<key>Library/Java/JavaVirtualMachines</key>
						<string>755</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%%install_location%</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/zulu-%JAVA_MAJOR_VERSION%.pkg/Payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
					<key>installs_item_paths</key>
					<array>
						<string>%install_location%</string>
					</array>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
						<string>%RECIPE_CACHE_DIR%/unpack/</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Azul Zulu Java %JAVA_MAJOR_VERSION% %BUNDLE_TYPE% %ARCHITECTURE%</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.14.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%/%ARCHITECTURE%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>supported_architectures</key>
				<array>
					<string>%MUNKI_ARCHITECTURE%</string>
				</array>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
			</dict>
		</dict>
		<key>Process</key>
	    <array>
    	    <dict>
        	    <key>Arguments</key>
            	<dict>
                	<key>destination_path</key>
        	        <string>%RECIPE_CACHE_DIR%/unpack</string>
        	        <key>flat_pkg_path</key>
            	    <string>%pkg_path%</string>
            	</dict>
            	<key>Processor</key>
            	<string>FlatPkgUnpacker</string>
        	</dict>
	        <dict>
	            <key>Arguments</key>
	            <dict>
	                <key>pkgdirs</key>
	                <dict>
	                    <key>Library</key>
	                    <string>0755</string>
    	                <key>Library/Java</key>
        	            <string>0755</string>
            	        <key>Library/Java/JavaVirtualMachines</key>
                	    <string>0755</string>
                    	<key>Library/Java/JavaVirtualMachines/zulu-8.jre</key>
                    	<string>0755</string>
                	</dict>
                	<key>pkgroot</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%</string>
            	</dict>
            	<key>Processor</key>
            	<string>PkgRootCreator</string>
        	</dict>
        	<dict>
            	<key>Arguments</key>
            	<dict>
                	<key>destination_path</key>
                	<string>%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-8.jre</string>
                	<key>pkg_payload_path</key>
                	<string>%RECIPE_CACHE_DIR%/unpack/zulu-8.pkg/Payload</string>
                	<key>purge_destination</key>
                	<true/>
            	</dict>
            	<key>Processor</key>
            	<string>PkgPayloadUnpacker</string>
        	</dict>
        	<dict>
            	<key>Arguments</key>
            	<dict>
                	<key>faux_root</key>
               	 <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                	<key>installs_item_paths</key>
                	<array>
                    	<string>/Library/Java/JavaVirtualMachines/zulu-8.jre</string>
                	</array>
                	<key>version_comparison_key</key>
                	<string>CFBundleShortVersionString</string>
            	</dict>
            	<key>Processor</key>
            	<string>MunkiInstallsItemsCreator</string>
        	</dict>
        	<dict>
            	<key>Processor</key>
            	<string>MunkiPkginfoMerger</string>
        	</dict>
        	<dict>
            	<key>Arguments</key>
            	<dict>
                	<key>changes</key>
                	<array>
                    	<dict>
                        	<key>path</key>
                        	<string>/Library/Java/JavaVirtualMachines/zulu-8.jre</string>
                        	<key>CFBundleIdentifier</key>
                        	<string>com.azul.zulu.jre</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>com.github.dataJAR-recipes.Shared Processors/InstallsArrayCFBundleIdentifierChanger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-8.jre/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                    <string>%RECIPE_CACHE_DIR%/unpack/</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
