<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest release dmg version of Azul Zulu Java for
given Java version, architecture, and bundle type (JDK/JRE),
then uploads the package to munki.
Architectures: x86, arm
Bundle Types: jre, jdk, jre_fx, jdk_fx
Munki Architectures: x86_64, arm64
</string>
		<key>Identifier</key>
		<string>com.jelockwood.recipe.munki.AzulZuluJava00</string>
		<key>MinimumVersion</key>
		<string>2.3.0</string>
		<key>ParentRecipe</key>
		<string>com.github.davidbpirie.munki.AzulZuluJava</string>
</plist>
