<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest release version of Azul Zulu Java for given
Java version, architecture, bundle type (JDK/JRE) and file
extension.
Architectures: x86, arm
Extensions: zip, tar.gz, dmg
Bundle Types: jre, jdk, jre_fx, jdk_fx
</string>
		<key>Identifier</key>
		<string>com.github.jelockwood.download.ARM.AzulZuluOpenJDK17LTS</string>
		<key>MinimumVersion</key>
		<string>2.3.0</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>AzulZuluJava</string>
			<key>JAVA_MAJOR_VERSION</key>
			<integer>17</integer>
			<key>ARCHITECTURE</key>
			<string>arm</string>
			<key>DOWNLOAD_FILE_EXTENSION</key>
			<string>dmg</string>
			<key>BUNDLE_TYPE</key>
			<string>jdk</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>AzulZuluJavaInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>java_major_version</key>
					<string>%JAVA_MAJOR_VERSION%</string>
					<key>arch</key>
					<string>%ARCHITECTURE%</string>
					<key>extension</key>
					<string>%DOWNLOAD_FILE_EXTENSION%</string>
					<key>bundle_type</key>
					<string>%BUNDLE_TYPE%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
