<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release Apple Silicon version of Azul Zulu OpenJDK 17 LTS,
extracts the package, and imports it to munki.
Based on Azul Zulu OpenJDK 11 LTS recipes by dataJAR.
</string>
		<key>Identifier</key>
		<string>com.github.jelockwood.munki.ARM.AzulZuluOpenJDK17LTS</string>
		<key>ParentRecipe</key>
		<string>com.github.jelockwood.pkg.ARM.AzulZuluOpenJDK17LTS</string>
		<key>MinimumVersion</key>
		<string>2.3.0</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>AzulZuluOpenJDK17LTS</string>
			<key>ARCHITECTURE</key>
			<string>aarch</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Azul Zulu Open JDK 17 LTS (ARM)</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Azul Zulu builds of OpenJDK are open source, TCK-tested and certified builds of OpenJDK. Azul Zulu is available for a wide range of hardware platforms and operating systems.</string>
			<key>MUNKI_CATEGORY</key>
			<string>Developer Tools</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Azul Systems</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>11.0.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%/%ARCHITECTURE%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>supported_architectures</key>
				<array>
					<string>arm64</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
				<key>Arguments</key>
				<dict>
					<key>warning_message</key>
					<string>This processor is deprecated and will be removed from this repository by 2022/10/30.
You may want to consider the more generic and flexible AzulZuluJava recipes I have written.
</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pkg_path%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Library</key>
						<integer>755</integer>
						<key>Library/Java</key>
						<integer>755</integer>
						<key>Library/Java/JavaVirtualMachines</key>
						<integer>755</integer>
						<key>Library/Java/JavaVirtualMachines/zulu-17.jdk</key>
						<integer>755</integer>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-17.jdk</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/zulu-17.pkg/Payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
					<key>installs_item_paths</key>
					<array>
						<string>/Library/Java/JavaVirtualMachines/zulu-17.jdk</string>
					</array>
					<key>version_comparison_key</key>
					<string>CFBundleVersion</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PlistReader</string>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-17.jdk/Contents/Info.plist</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleVersion</key>
						<string>version</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
						<string>%RECIPE_CACHE_DIR%/unpack/</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
