<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Proton Drive.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.ProtonDrive</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Proton Drive</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
        <dict>
	            <key>Arguments</key>
	            <dict>
	                <key>re_pattern</key>
	                <string>url="(https://proton\.me/download/drive/macos/([0-9]+(\.[0-9]+)+)/ProtonDrive-([0-9]+(\.[0-9]+)+)\.tar\.xz)"</string>
	                <key>result_output_var_name</key>
	                <string>DOWNLOAD_URL</string>
	                <key>url</key>
	                <string>https://proton.me/download/drive/macos/appcast.xml</string>
	            </dict>
	            <key>Processor</key>
	            <string>URLTextSearcher</string>
	        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.tar.xz</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>archive_format</key>
				<string>tar</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%/Proton Drive.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "ch.protonmail.drive" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2SB5Z68H26")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Proton Drive.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
