<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Jamf Compliance Editor.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.JamfComplianceEditor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Jamf Compliance Editor</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(&lt;a href=\"(?P&lt;url&gt;\/\/cdn\.document360.io\/\b[0-9a-f]{8}\b-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-\b[0-9a-f]{12}\b/Images/Documentation/Jamf%20Compliance%20Editor%20v.*)\".*(?P&lt;filename&gt;Jamf Compliance Editor.*.tar.gz?))</string>
				<key>url</key>
				<string>https://trusted.jamf.com/docs/establishing-compliance-baselines</string>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9</string>
				</dict>
			</dict>
		</dict>
		<dict>
    			<key>Arguments</key>
    			<dict>
        			<key>string_to_replace</key>
        			<string>&amp;amp;</string>
        			<key>input_string</key>
        			<string>%match%</string>
        			<key>replacement_string</key>
        			<string>&amp;</string>
    			</dict>
    			<key>Processor</key>
   			<string>com.github.jelockwood.recipes.StringReplacer/StringReplacer</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%output_string%</string>
				<key>filename</key>
				<string>%filename%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.jamf.complianceeditor" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "483DWKW443")</string>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unzip/Jamf Compliance Editor.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
