<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Jamf Compliance Editor.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.download.JamfComplianceEditor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Jamf Compliance Editor</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Safari/537.36</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(\/\/cdn\.document360\.io\/\S{8}-\S{4}-\S{4}-\S{4}-\S{12}\/Images\/Documentation\/Jamf%20Compliance%20Editor%20v\d+.\d+.\d+.tar.gz\?sv=\d{4}-\d{2}-\d{2}.*spr=https%2Chttp.*st=\d{4}-\d{2}-\d{2}.*se=\d{4}-\d{2}-\d{2}.*srt=.*sp=r)</string>
				<key>url</key>
				<string>https://trusted.jamf.com/docs/establishing-compliance-baselines</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
