<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the latest version of PCClient.</string>
	<key>Identifier</key>
	<string>com.github.jelockwood.recipes.pkg.PCClient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PCClient</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jelockwood.recipes.download.PCClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkgdirs</key>
				<dict/>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
	        <dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/*.app</string>
			</dict>
                </dict>
		<dict>
			<key>Processor</key>
			<string>PlistEditor</string>
			<key>Arguments</key>
			<dict>
				<key>output_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/com.papercut.client.agent.plist</string>
				<key>plist_data</key>
				<dict>
					<key>KeepAlive</key>
					<true/>
					<key>Label</key>
					<string>com.papercut.client.agent</string>
					<key>ProgramArguments</key>
					<array>
						<string>/Applications/PCClient.app/Contents/MacOS/JavaAppLauncher</string>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%found_filename%/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/preinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/sh
## preinstall

pathToScript=$0
pathToPackage=$1
targetLocation=$2
targetVolume=$3

if [[ -e "/Library/LaunchAgents/com.papercut.client.plist" ]]; then
	/bin/launchctl unload /Library/LaunchAgents/com.papercut.client.plist
	/bin/rm -f "Library/LaunchAgents/com.papercut.client.plist"
fi
if [[ -e "/Applications/PCClient.app" ]]; then
	/usr/bin/sudo /bin/rm -R /Applications/PCClient.app/
	/usr/bin/sudo /usr/bin/killall JavaAppLauncher
fi

exit 0		## Success
exit 1		## Failure
				</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
				<key>file_mode</key>
				<string>0755</string>
				<key>file_content</key>
				<string>#!/bin/sh
# Install PaperCut client launchagent
LOGGER="/usr/bin/logger"

# Determine working directory
install_dir=`dirname $0`
	
	
# Install PaperCut Client and launchagent
	
if [[ -e "$install_dir/PCClient.app" ]]; then
		${LOGGER} "Installing PaperCut Client"
		/bin/cp -p -R "$install_dir/PCClient.app" /Applications/
		# /bin/cp -p "$install_dir/papercut-start.sh" /usr/local/munki/
		# /bin/rm -f "$install_dir/com.papercut.client.plist"
		/bin/cp -p "$install_dir/com.papercut.client.plist" /Library/LaunchAgents/com.papercut.client.plist
		/usr/sbin/chown root:wheel /Library/LaunchAgents/com.papercut.client.plist
		/usr/bin/chmod 644 /Library/LaunchAgents/com.papercut.client.plist
		# /usr/sbin/chown root:wheel /usr/local/munki/papercut-start.sh
		# /usr/bin/chmod 644 /usr/local/munki/papercut-start.sh
		/bin/launchctl load /Library/LaunchAgents/com.papercut.client.plist
else
		${LOGGER} "Could not find file"
fi

exit
				</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgname</key>
					<string>%NAME%_%version%</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>id</key>
					<string>com.jelockwood.papercut.pkg</string>
					<key>version</key>
					<string>%version%</string>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
